Repository: Zojax/zojax.principal.password
Catalog: src/zojax/principal/password/locales/*/LC_MESSAGES/zojax.principal.password.po
Languages: nl, ru

source: Password and Confirm Password should be the same.
nl: Wachtwoord en bevestiging wachtwoord moeten hetzelfde zijn.
ru: Пароль и подтверждение должны быть одинаковые.

source: Does not match current password.
nl: Komt niet overeen met huidig wachtwoord.
ru: Пароль не соответствует текущему паролю.

source: Current password
nl: Huidig wachtwoord
ru: Текущий пароль

source: Enter your current password.
nl: Geef uw huidige wachtwoord.
ru: Введите ваш пароль

source: New password
nl: Nieuw wachtwoord
ru: Новый пароль

source: Enter new password. No spaces or special characters, should contain digits and letters in mixed case.
nl: Geef nieuw wachtwoord. Deze moet bestaan uit letters en cijfers, maar geen spaties of speciale karakters.
ru: Введите новый пароль. Без пробелов и специальных символов. Пароль должен содержать цифры и буквы.

source: Confirm password
nl: Bevestiging wachtwoord
ru: Подтвердите пароль

source: Re-enter the password. Make sure the passwords are identical.
nl: Herhaal het wachtwoord. Deze moet gelijk zijn aan het vorige.
ru: Введите пароль. Удостовертись что пароли одинаковые.

source: Change password
nl: Wijzig wachtwoord
ru: Изменить пароль

source: Password has been changed for %(title)s.title
nl: Wachtwoord is aangepast voor %(title)s.title
ru: Пароль изменен для %(title)s.title

source: Sorry, system can't update your creadential data. You should logout and login with new password.
nl: Sorry, we kunnen uw vertrouwelijke gegevens niet updaten. Hiervoor zult u opnieuw moeten inloggen met uw nieuwe wachtwoord.

source: My user login is
nl: Mijn gebruikersnaam is
ru: Мой логин

source: Lost Password
nl: Vergeten wachtwoord
ru: Восстановить пароль

source: Reset my password
nl: Reset mijn wachtwoord
ru: Изменить мой пароль

source: For security reasons, we store your password encrypted, and cannot mail it to you. If you would like to reset your password, fill out the form below and we will send you an email at the address you gave when you registered to start the process of resetting your password. If this will not work for you (for example, if you forgot your member name or your email address has changed) send an email to ${address}.
nl: Voor veiligheidsredenen slaan we uw wachtwoord versleuteld op en kunnen we het u niet e-mailen. Als u uw wachtwoord wilt herstellen vul dan het onderstaande formulier in en we zullen u een e-mail sturen naar het adres dat u gebruikte tijdens de registratie om de procedure in werking te zetten. Mocht dit niet werken, omdat u bijvoorbeeld de gebruikersnaam bent vergeten of uw e-mailadres is aangepast, stuur dan een e-mail naar ${address}.
ru: Из соображения безопастности мы храним ваш пароль в зашифрованном виде, и не можем послать его по почте. Если вы хотите изменить ваш пароль, заполните форму и мы пошлем вам писмо с инструкцией по изменению вашего пароля. Если вам не подходит этот метод пошлите запрос по почте на адрес ${address}.

source: System can't restore password for this principal.
nl: Het systeem kan het wachtwoord voor deze persoon/groep niet herstellen.
ru: Система не может востановить пароль для этого пользователя.

source: You have been successfully changed password.
nl: Wachtwoord is succesvol gewijzigd.
ru: Вы успешно изменили пароль.

source: There were some errors.
nl: Er waren een aantal fouten.
ru: Произошли ошибки

source: Passcode is invalid.
nl: Wachtwoord is ongeldig.
ru: Непрвильный 'passcode'

source: Your password has been reset and is being emailed to you.
nl: Uw wachtwoord is gereset en wordt naar uw e-mailadres gestuurd.
ru: Ваш пароль изменен и послан на ваш электронной адрес.

source: Password confirmation for ${title}
nl: Wachtwoordbevestiging voor ${title}
ru: Подтверждение пароля для ${title}

source: Please change your password
nl: Hier kunt u uw wachtwoord wijzigen
ru: Изменить пароль

source: Password reseting process has been initiated. You must visit link below to complete password reseting:
nl: Wachtwoord reset procedure is in werking gesteld. U kunt nu de onderstaande link bezoeken om het resetten van het wachtwoord te voltooien:
ru: Вы должны посетить ссылку, для завершения изменения пароля:

source: Request made by IP ${ip} at ${date}
nl: Verzoek gedaan door IP ${ip} op ${date}
ru: Запрос сдела с IP ${ip} в ${date}

source: Password tool
nl: Wachtwoord utility
ru: Сервис паролей

source: Password managing/generating configuration.
nl: Wachtwoord beheren/genereren configuratie.
ru: Конфигурация изменения и генерации паролей.

source: Default password checker configuration.
nl: Standaard wachtwoord controle configuratie.
ru: Конфигурация проверки паролей по умолчанию

source: You can change your password here.
nl: Hier kunt u uw wachtwoord wijzigen.
ru: Вы можете изменить ваш пароль здесь.

source: Default password checker
nl: Standaard wachtwoordcontrole configuratie.
ru: Проверка паролей по умолчанию

source: Password should be at least ${count} characters.
nl: Wachtwoord moet minstens ${count} tekens bevatten
ru: Пароль должен содержать как минимум ${count} символов.

source: Password min length exceeded.
nl: Minimale lengte van het wachtwoord is bereikt
ru: Недостаточная длина пароля.

source: Password should contain both letters and digits.
nl: Wachtwoord moet letters en cijfers bevatten.
ru: Пароль должен содержать буквы и цифры.

source: Password should contain letters in mixed case.
nl: Wachtwoord moet letters en hoofdletters bevatten.
ru: Парольдолжен содержать буквы в смешанном регистре.

source: Minimum length
nl: Minimale lengte
ru: Минимальная длина

source: Minimun length of password.
nl: Minimale lengte van het wachtwoord.
ru: Минимальная длина пароля

source: Letters and digits
nl: Letters en cijfers
ru: Буквы и цифры

source: Letters case
nl: Letters
ru: Регистр букв

source: Password manager
nl: Wachtwoordbeheer
ru: Менеджер паролей

source: Password checker
nl: Wachtwoordcontrole
ru: Проверка паролей
